src/Documents/ЗаявкаНаРасходДС/ЗаявкаНаРасходДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРасходДС</name>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>КОплате</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗаявкаНаРасходДС/Forms/Документ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение ();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Новая;
	Объект.Валюта = Справочники.Валюты.Гривна;
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.ДатаЗаявки = ТекущаяДата ();
	сотрудник = ОбщийДокументы.ПолучитьСотрудникаПользователя ( Объект.Ответственный );
	Объект.Заявитель = сотрудник;
	Объект.Получатель = сотрудник;  
	
КонецПроцедуры
